---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotFinishGroupInSketchMode
source: html/5ebcbac8-f01f-eb2c-0904-6cc08b8237e9.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.CannotFinishGroupInSketchMode Property

Can't Finish Group while in Sketch Mode.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotFinishGroupInSketchMode { get; }
```